{
  "plugins": {
    "better-escape": {
      "src": "https://github.com/max397574/better-escape.nvim"
    },
    "blink": {
      "src": "https://github.com/saghen/blink.cmp"
    },
    "blink-copilot": {
      "src": "https://github.com/fang2hou/blink-copilot"
    },
    "codecompanion": {
      "src": "https://github.com/olimorris/codecompanion.nvim"
    },
    "conform": {
      "src": "https://github.com/stevearc/conform.nvim"
    },
    "dap": {
      "src": "https://github.com/mfussenegger/nvim-dap"
    },
    "dap-view": {
      "src": "https://github.com/igorlfs/nvim-dap-view"
    },
    "fidget": {
      "src": "https://github.com/j-hui/fidget.nvim"
    },
    "flash": {
      "src": "https://github.com/folke/flash.nvim"
    },
    "flutter-tools": {
      "src": "https://github.com/nvim-flutter/flutter-tools.nvim"
    },
    "friendly-snippets": {
      "src": "https://github.com/rafamadriz/friendly-snippets"
    },
    "fzf-lua": {
      "src": "https://github.com/ibhagwan/fzf-lua"
    },
    "gitsigns": {
      "src": "https://github.com/lewis6991/gitsigns.nvim"
    },
    "img-clip": {
      "src": "https://github.com/hakonharnes/img-clip.nvim"
    },
    "indent-blankline": {
      "src": "https://github.com/lukas-reineke/indent-blankline.nvim"
    },
    "lazygit": {
      "src": "https://github.com/kdheepak/lazygit.nvim"
    },
    "lspkind": {
      "src": "https://github.com/onsails/lspkind.nvim"
    },
    "lualine": {
      "src": "https://github.com/nvim-lualine/lualine.nvim"
    },
    "markdown-preview": {
      "src": "https://github.com/iamcco/markdown-preview.nvim"
    },
    "mason": {
      "src": "https://github.com/mason-org/mason.nvim"
    },
    "mason-lspconfig": {
      "src": "https://github.com/mason-org/mason-lspconfig.nvim"
    },
    "melange": {
      "src": "https://github.com/savq/melange-nvim"
    },
    "mini.icons": {
      "src": "https://github.com/nvim-mini/mini.icons"
    },
    "mini.pairs": {
      "src": "https://github.com/nvim-mini/mini.pairs"
    },
    "mini.snippets": {
      "src": "https://github.com/nvim-mini/mini.snippets"
    },
    "mini.starter": {
      "src": "https://github.com/nvim-mini/mini.starter"
    },
    "minuet-ai": {
      "src": "https://github.com/milanglacier/minuet-ai.nvim"
    },
    "nvim-lspconfig": {
      "src": "https://github.com/neovim/nvim-lspconfig"
    },
    "nvim-treesitter": {
      "src": "https://github.com/nvim-treesitter/nvim-treesitter",
      "version": "'main'"
    },
    "oil": {
      "src": "https://github.com/stevearc/oil.nvim"
    },
    "opencode": {
      "src": "https://github.com/NickvanDyke/opencode.nvim"
    },
    "overseer": {
      "src": "https://github.com/stevearc/overseer.nvim"
    },
    "petrolnoir": {
      "src": "https://github.com/connormxfadden/petrolnoir.nvim"
    },
    "plenary.nvim": {
      "src": "https://github.com/nvim-lua/plenary.nvim"
    },
    "rainbow-delimiters": {
      "src": "https://gitlab.com//HiPhish/rainbow-delimiters.nvim"
    },
    "smear-cursor": {
      "src": "https://github.com/sphamba/smear-cursor.nvim"
    },
    "snacks": {
      "src": "https://github.com/folke/snacks.nvim"
    },
    "teide": {
      "src": "https://github.com/serhez/teide.nvim"
    },
    "todo-comments": {
      "src": "https://github.com/folke/todo-comments.nvim"
    },
    "treesitter-context": {
      "src": "https://github.com/nvim-treesitter/nvim-treesitter-context"
    },
    "typescript-tools": {
      "src": "https://github.com/pmizio/typescript-tools.nvim"
    },
    "vague": {
      "src": "https://github.com/vague2k/vague.nvim"
    },
    "vimwiki": {
      "src": "https://github.com/vimwiki/vimwiki",
      "version": "'dev'"
    },
    "winsep": {
      "src": "https://github.com/nvim-zh/colorful-winsep.nvim"
    },
    "zen-mode": {
      "src": "https://github.com/folke/zen-mode.nvim"
    }
  }
}