{
  "plugins": {
    "better-escape": {
      "src": "https://github.com/max397574/better-escape.nvim"
    },
    "better-escape.nvim": {
      "src": "https://github.com/max397574/better-escape.nvim"
    },
    "codecompanion": {
      "src": "https://github.com/olimorris/codecompanion.nvim"
    },
    "conform": {
      "src": "https://github.com/stevearc/conform.nvim"
    },
    "dap": {
      "src": "https://github.com/mfussenegger/nvim-dap"
    },
    "dap-view": {
      "src": "https://github.com/igorlfs/nvim-dap-view"
    },
    "fidget": {
      "src": "https://github.com/j-hui/fidget.nvim"
    },
    "flutter-tools": {
      "src": "https://github.com/nvim-flutter/flutter-tools.nvim"
    },
    "flutter-tools.nvim": {
      "src": "https://github.com/nvim-flutter/flutter-tools.nvim"
    },
    "github-nvim-theme": {
      "src": "https://github.com/projekt0n/github-nvim-theme"
    },
    "github-theme": {
      "src": "https://github.com/projekt0n/github-nvim-theme"
    },
    "gitsigns": {
      "src": "https://github.com/lewis6991/gitsigns.nvim"
    },
    "gitsigns.nvim": {
      "src": "https://github.com/lewis6991/gitsigns.nvim"
    },
    "img-clip": {
      "src": "https://github.com/hakonharnes/img-clip.nvim"
    },
    "img-clip.nvim": {
      "src": "https://github.com/hakonharnes/img-clip.nvim"
    },
    "lazygit": {
      "src": "https://github.com/kdheepak/lazygit.nvim"
    },
    "lazygit.nvim": {
      "src": "https://github.com/kdheepak/lazygit.nvim"
    },
    "lspkind": {
      "src": "https://github.com/onsails/lspkind.nvim"
    },
    "lspkind.nvim": {
      "src": "https://github.com/onsails/lspkind.nvim"
    },
    "markdown-preview": {
      "src": "https://github.com/iamcco/markdown-preview.nvim"
    },
    "markdown-preview.nvim": {
      "src": "https://github.com/iamcco/markdown-preview.nvim"
    },
    "markview": {
      "src": "https://github.com/OXY2DEV/markview.nvim"
    },
    "mason": {
      "src": "https://github.com/mason-org/mason.nvim"
    },
    "mason.nvim": {
      "src": "https://github.com/mason-org/mason.nvim"
    },
    "mini.icons": {
      "src": "https://github.com/nvim-mini/mini.icons"
    },
    "mini.pairs": {
      "src": "https://github.com/nvim-mini/mini.pairs"
    },
    "mini.pick": {
      "src": "https://github.com/echasnovski/mini.pick"
    },
    "mini.starter": {
      "src": "https://github.com/nvim-mini/mini.starter"
    },
    "nvim-eslint": {
      "src": "https://github.com/esmuellert/nvim-eslint"
    },
    "nvim-lspconfig": {
      "src": "https://github.com/neovim/nvim-lspconfig"
    },
    "nvim-treesitter": {
      "src": "https://github.com/nvim-treesitter/nvim-treesitter",
      "version": "'main'"
    },
    "oil": {
      "src": "https://github.com/stevearc/oil.nvim"
    },
    "oil.nvim": {
      "src": "https://github.com/stevearc/oil.nvim"
    },
    "plenary": {
      "src": "https://github.com/nvim-lua/plenary.nvim"
    },
    "plenary.nvim": {
      "src": "https://github.com/nvim-lua/plenary.nvim"
    },
    "smear-cursor": {
      "src": "https://github.com/sphamba/smear-cursor.nvim"
    },
    "supermaven": {
      "src": "https://github.com/supermaven-inc/supermaven-nvim"
    },
    "todo-comments": {
      "src": "https://github.com/folke/todo-comments.nvim"
    },
    "todo-comments.nvim": {
      "src": "https://github.com/folke/todo-comments.nvim"
    },
    "treesitter": {
      "src": "https://github.com/nvim-treesitter/nvim-treesitter",
      "version": "'main'"
    },
    "typescript-tools": {
      "src": "https://github.com/pmizio/typescript-tools.nvim"
    },
    "typescript-tools.nvim": {
      "src": "https://github.com/pmizio/typescript-tools.nvim"
    },
    "vague": {
      "src": "https://github.com/vague2k/vague.nvim"
    },
    "vague.nvim": {
      "src": "https://github.com/vague2k/vague.nvim"
    },
    "vimwiki": {
      "src": "https://github.com/vimwiki/vimwiki",
      "version": "'dev'"
    }
  }
}